{
  "id": "enroll-001",
  "displayName": "Default Enrollment Restrictions",
  "type": "enrollmentConfigurations",
  "settings": {
    "devicePlatformRestrictions": [
      {
        "platform": "android",
        "allowPersonalDeviceEnrollment": false
      }
    ]
  },
  "assignments": [
    {
      "target": {
        "groupId": "group-014",
        "groupDisplayName": "All Users",
        "groupType": "microsoft365",
        "assignmentType": "include"
      },
      "intent": "required",
      "delivery": {
        "notification": "showAll",
        "restartSettings": "default"
      },
      "schedule": {
        "startDateTime": "2024-11-15T00:00:00Z",
        "endDateTime": null
      }
    }
  ],
  "sourceResource": {
    "graphResourceName": "deviceEnrollmentConfiguration",
    "graphCollectionPath": "/deviceManagement/deviceEnrollmentConfigurations"
  },
  "raw": {
    "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration"
  }
}
